app/views/teams/show.html.erb

        <ul>
          <% @team.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 9]]

        <ul>
          <% Player.all.reject { |player| @team.players.include?(player) }.each do |player| %>
---
SELECT 1 AS one FROM "players" WHERE "players"."team_id" = $1 AND "players"."id" = $2 LIMIT $3  [["team_id", 8], ["id", 173], ["LIMIT", 1]]
SELECT "players".* FROM "players"