app/views/teams/show.html.erb

  <ul>
    <% Player.all.reject { |player| @team.players.include?(player) }.each do |player| %>
---
SELECT 1 AS one FROM "players" WHERE "players"."team_id" = $1 AND "players"."id" = $2 LIMIT $3  [["team_id", 8], ["id", 1], ["LIMIT", 1]]