app/views/matches/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 9]]
---
        <ul>
            <% @match.home_team.players.each do |player| %>

SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 6]]
---
                <ul>
            <% @match.away_team.players.each do |player| %>