app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @match = Match.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "matches" ("home_team_id", "away_team_id", "home_score", "away_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["home_team_id", 9], ["away_team_id", 8], ["home_score", nil], ["away_score", nil], ["created_at", "2024-11-16 14:49:16.658179"], ["updated_at", "2024-11-16 14:49:16.658179"]]
---
  def create
    @home_team = Team.find(params[:home_team_id])
    @away_team = Team.find(params[:away_team_id])
    @match = Match.new(home_team: @home_team, away_team: @away_team)

    if @match.save

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "matches" SET "home_score" = $1, "away_score" = $2, "updated_at" = $3 WHERE "matches"."id" = $4  [["home_score", 1], ["away_score", 1], ["updated_at", "2024-11-16 15:38:05.015116"], ["id", 3]]
---
  def simulate
    @match = Match.find(params[:id])
    # Lógica para simular a partida
    # (atribui valores aleatórios para os atributos home_score e away_score)
    @match.simulate
    @match.save