app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = $1  [["user_id", 1]]
---
  def index
    @teams = Team.where(user_id: current_user.id)

INSERT INTO "teams" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Flamingo"], ["created_at", "2024-11-16 13:06:52.462299"], ["updated_at", "2024-11-16 13:06:52.462299"], ["user_id", nil]]
---
  def create
    @team = current_user.teams.build(team_params)
    if @team.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "players" SET "team_id" = $1 WHERE "players"."team_id" = $2 AND ("players"."id" = $3 OR "players"."id" = $4 OR "players"."id" = $5 OR "players"."id" = $6 OR "players"."id" = $7 OR "players"."id" = $8 OR "players"."id" = $9 OR "players"."id" = $10 OR "players"."id" = $11 OR "players"."id" = $12 OR "players"."id" = $13 OR "players"."id" = $14 OR "players"."id" = $15 OR "players"."id" = $16 OR "players"."id" = $17 OR "players"."id" = $18)
---
  def buy_players
    @team = Team.find(params[:id])
    if params[:team] && params[:team][:player_ids]
      @team.player_ids = (@team.player_ids + params[:team][:player_ids]).uniq
    else
      redirect_to @team, alert: 'Nenhum jogador selecionado.' and return
    end

    if @team.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" != $1  [["id", 9]]
UPDATE "players" SET "team_id" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["team_id", 4], ["updated_at", "2024-11-18 01:12:37.217113"], ["id", 98]]
---
  def sell_players
    @team = Team.find(params[:id])
    player_ids = params[:team] ? params[:team][:player_ids] : nil

    if player_ids.present?
      player_ids.each do |player_id|
        player = Player.find(player_id)
        random_team = Team.where.not(id: @team.id).sample
        player.update(team: random_team)