app/controllers/teams_controller.rb

  def update_players
    @team = Team.find(params[:id])
    @team.player_ids = params[:team][:player_ids]
    if @team.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "players" SET "team_id" = $1 WHERE "players"."team_id" = $2 AND ("players"."id" = $3 OR "players"."id" = $4 OR "players"."id" = $5 OR "players"."id" = $6 OR "players"."id" = $7 OR "players"."id" = $8 OR "players"."id" = $9 OR "players"."id" = $10 OR "players"."id" = $11 OR "players"."id" = $12 OR "players"."id" = $13 OR "players"."id" = $14 OR "players"."id" = $15 OR "players"."id" = $16 OR "players"."id" = $17 OR "players"."id" = $18)